{
  "terms": [
    {
      "term": "Integral (math term)",
      "code": "\n# f is the function to be integrated\n# a and b are the limits of integration\n# n is the number of subintervals\nfunction integrate(f, a, b, n):\n\tstep_size = (b - a) / n  # Calculate the width of each subinterval\n\tresult = 0  # Initialize the result to zero\n\n\tfor i from 0 to n:\n\t\t# Calculate the left and right endpoints of the current subinterval\n\t\tx0 = a + i * step_size\n\t\tx1 = a + (i + 1) * step_size\n\n\t\t# Calculate the area of the trapezoid and add it to the result\n\t\tresult = result + 0.5 * (f(x0) + f(x1)) * (x1 - x0)\n\treturn result",
      "definition": [
        "Possessing everything essential; entire.",
        "A measurement of accumulated change"
      ],
      "graphics": [
        "/resources/integral/Integral.mp4"
      ],
      "examples": [
        "It's like cutting a cake into infinitely thin slices, measuring each slice, and then adding them all up to get the whole cake."
      ]
    },
    {
      "term": "Derivative (math term)",
      "code": "function calculate_derivative(coefficients):\n\t// Initialize an empty list for the derivative coefficients\n\tderivative_coefficients = []\n\n\t// Iterate through the coefficients of the polynomial in reverse order\n\tfor i from len(coefficients) - 1 to 1:\n\t\t// Calculate the derivative coefficient for the current term\n\t\tderivative_coefficient = i * coefficients[i]\n\n\t\t// Append the derivative coefficient to the result\n\t\tderivative_coefficients.append(derivative_coefficient)\n\n\t// Return the list of derivative coefficients\n\treturn derivative_coefficients",
      "definition": [
        "Instantaneous rate of change",
        "The rate of an increase of a function",
        "A description of the direction and speed of an object's motion, such as how an object accelerates or decelerates"
      ],
      "graphics": [
        "/resources/derivatives/derivative.mp4"
      ],
      "examples": [
        "y=3x: the line's value increases by 3 for each x value, so the derivative is y=3",
        "The derivative helps find the tangent line (the line that just touches the curve) at a given point."
      ]
    },
    {
      "term": "Dot Product",
      "code": "datapoint = [2, 4]\nunitVector = [.25, .75]\nsum = 0\nfor dimension in range(len(unitVector)):\n\tsum += datapoint[dimension] * unitVector[dimension]\nreturn sum",
      "definition": [
        "An algebraic operation that takes two equal-length sequences of numbers, and returns a single number."
      ],
      "examples": [
        "Imagine you have two arrows (vectors) and you want to know how much they're pushing in the same direction",
        "Plotting of two dimensional data onto a single dimensional vector"
      ]
    },
    {
      "term": "Juxtaposition",
      "definition": [
        "Putting two contrasting items next to each other to highlight how they're different, or similar things to emphasize their likeness.",
        "Placing two very different things side by side to make a point",
        "When you pair up two things in a way that makes you notice how they're opposite or alike, making a stronger point"
      ],
      "examples": [
        "Showing a hot cup of coffee next to a melting ice cream cone to highlight the difference in temperature"
      ]
    }
  ]
}